app/Controllers/BIT28Controller.php

SELECT *
FROM `students`
WHERE `student_id` = '26'
DELETE FROM `students`
WHERE `student_id` = '26'
---
public function delete_student()
{
    $id = $this->request->getPost('student_id');
    $model = new \App\Models\QuizModel();

    // Get student record
    $db = \Config\Database::connect();
    $student = $db->table('students')->where('student_id', $id)->get()->getRow();

    if (!$student) {
        return $this->response->setJSON([
            'success' => false,
            'message' => 'Student not found.'
        ]);
    }

    // Delete the file
    if (!empty($student->image_filename)) {
        $filePath = FCPATH . 'uploads/' . $student->image_filename;
        if (file_exists($filePath)) {
            unlink($filePath);
        }
    }

    // Delete from DB
    $db->table('students')->where('student_id', $id)->delete();

SELECT *
FROM `students`
WHERE `name` = 'Mohamed Yusuf Ahmed aDAMU'
---
public function Bit28_a_save()
    {
       // helper(['form', 'filesystem']);

        $request = service('request');
        $name = $request->getPost('name');
        $message = $request->getPost('message');
        $file = $request->getFile('image');

        $model = new QuizModel();

        // Check if name already exists
        $db = \Config\Database::connect();
        $builder = $db->table('students');
        $builder->where('name', $name);
        $exists = $builder->get()->getRow();